app/controllers/items_controller.rb

  def index
    @user = current_user
    @item = Item.search(params[:search])
---
SELECT "items".* FROM "items" WHERE (title ILIKE '%bots%' AND user_id ILIKE current_user OR category ILIKE '%bots%' OR seller ILIKE '%bots%' OR note ILIKE '%bots%' OR cast(cost as text) ILIKE'%bots%')  ORDER BY created_at DESC

  def show
    @user = current_user
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @user = current_user
    @item = Item.new(item_params)
    @item.user_id = params[:user_id] # set user_id param from database relationship to current_user id
    @item.save
---
INSERT INTO "items" ("title", "category", "seller", "note", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Mountain Bike"], ["category", "Recreate"], ["seller", ""], ["note", ""], ["user_id", 3], ["created_at", "2016-06-07 20:29:31.583333"], ["updated_at", "2016-06-07 20:29:31.583333"]]

  def edit
    @user = current_user
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 17]]

  def update
   @user = current_user
   @item = Item.find(params[:id])
   @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 22]]
UPDATE "items" SET "title" = $1, "cost" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["title", "Fitbit"], ["cost", 105], ["updated_at", "2016-06-13 22:21:06.259882"], ["id", 22]]

  def destroy
    @user = User.find params[:user_id]
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 3]]